```
 ~ resource "dnsimple_zone_record" "z505NHHYX" {
        id               = 50888675
      ~ name             = "spaghettinuum.isandrew.com" -> "spaghettinuum"
      ~ priority         = 0 -> (known after apply)
      ~ qualified_name   = "spaghettinuum.isandrew.com.isandrew.com" -> (known after apply)
      ~ value_normalized = "spaghettinuum.isandrew.com.xmxxzn.flydns.net" -> (known after apply)
      ~ zone_id          = "isandrew.com" -> (known after apply)
        # (4 unchanged attributes hidden)
    }
```
Ah no worries, I don't think there's anything particularly non-public here.  I was changing `name`, other fields were left the same.